{
  "case-study": [
    {
      "content": "blender",
      "Title": "<p class='bullet-title'>Optimizing Blender Animation Export for OWNverse (VRM Viewer)</p>",
      "Introduction": "<p class='bullet-title'>Introduction</p><p class = 'paragraphs'>This case study examines the optimized process for exporting custom animations to the OWNverse VRM Viewer, a web-based VRM viewer built with Three.js, Ammo.js, and TypeScript. Unlike most VRM viewers that rely on Unity’s UniVRM package for animation handling, OWNverse requires specific export settings to ensure smooth playback. <br>Through experience with various VRM viewers, common import and export workflows have been identified. However, OWNverse presents unique challenges that demand a tailored Blender export process. This study provides a structured guide to help animators export animations efficiently while addressing common troubleshooting issues. <br>This workflow was implemented during my contract with Narrasoft, significantly accelerating project completion. By refining the export process, animation integration into OWNverse became seamless, reducing troubleshooting time and enhancing overall efficiency. </p>",
      "Background": "<p class='bullet-title'>Background</p><p class = 'paragraphs'>The VRM (Virtual Reality Model) format is widely used in VTubing, gaming, and metaverse platforms, allowing users to bring their avatars to life with custom animations. As these virtual environments continue to evolve, properly exporting animations becomes crucial for seamless integration.<br>Most VRM viewers, including those built on Unity, follow similar import/export pipelines. Unity-based VRM viewers typically rely on UniVRM, while web-based solutions like OWNverse take a different approach. Instead of Unity, OWNverse uses: <br>Three.js – A JavaScript library for rendering 3D graphics in the browser Ammo.js – A physics engine for handling character movement and interactions TypeScript – A structured, scalable approach to managing the viewer’s core functionalities Unlike Unity-based solutions, OWNverse enables users to view and animate VRM models directly in a web browser, making it lightweight and accessible. However, its export workflow requires specific considerations to ensure animations play correctly. This case study focuses on understanding and optimizing the Blender export process for OWNverse, ensuring a seamless transition from Blender to the web viewer.</p>",
      "Blender-exporting": "<p class='bullet-title'>Blender Exporting:</p><p class = 'paragraphs'>This section will guide you through importing custom animations into OWNverse.</p><div class='tutorial paragraphs'><ol><li class = 'paragraphs'>Step 1:<ol><li>Armature/Rig after animating</li><imgsrc='./asset/case_studies/fbx_export/step 1/Step 1 - After animating.png'></ol> </li> <li>Step 2: <ol class=' '> <li>Hide all IK and Pole Bones before baking</li> <img src='./asset/case_studies/fbx_export/step 2/Step 2 - Baking the animation.gif'> <li>Go to Pose > Animation and Bake Action</li> <img src='./asset/case_studies/fbx_export/step 2/pose-ui.png'> <li>Bake Action Popup should have Visual Keying & Clear Constraints checked. </li> <img src='./asset/case_studies/fbx_export/step 2/menu.png'> <li>Expected result:</li> <img src='./asset/case_studies/fbx_export/step 2/result.png'> </ol> </li> <li>Step 3: <ol class=' '> <li>Remove the IK and Poles in the Armature</li> <img src='./asset/case_studies/fbx_export/step 3/Step 3 - Renaming Bones.png'> <li>Follow Mixamo naming convention for bones.</li> <div class='grid grid-cols-2 justify-evenly gap-4 h-46'> <figure> <img src='./asset/case_studies/fbx_export/step 3/bone naming-sample1.png'> </figure> <figure> <img src='./asset/case_studies/fbx_export/step 3/bone naming-sample2.png'> </figure> <figure> <img src='./asset/case_studies/fbx_export/step 3/bone naming-sample3.png'> </figure> <figure> <img src='./asset/case_studies/fbx_export/step 3/bone naming-sample4.png'> </figure> <figure> <figcaption>mixamo naming convention on all bones</figcaption> <img src='./asset/case_studies/fbx_export/step 3/mixamonaming.png'> </figure> </div> <li>Go to Nonlinear Animation (NLA) and push down action.</li> <div class='grid grid-cols-2 justify-evenly gap-4'> <figure> <figcaption>you can locate NLA in this menu</figcaption> <img src='./asset/case_studies/fbx_export/step 3/NLA editor.png'> </figure> <figure> <figcaption>NLA Strip</figcaption><img src='./asset/case_studies/fbx_export/step 3/NLA stips.png'></figure></div></ol></li><li>Step 4:<ol class=' '><li>Add T-Pose in the Timeline.</li><img src='./asset/case_studies/fbx_export/step 4/timeline.png'><li>Export as FBX with 'Only Deform Bones' checked.</li><figure><figcaption>Blender Export</figcaption><img src='./asset/case_studies/fbx_export/step 4/export menu.png'></figure></ol></li><li>Final Result:<ol class=' '><li>Go to VRM Viewer (OWNverse) and test your animation.</li><figure><figcaption>Sample</figcaption><img src='./asset/case_studies/fbx_export/step 4/final result.gif'></figure></ol></li></ol></div>",
      "Troubleshooting & Optimization": "<p class='bullet-title'>Troubleshooting & Optimization</p> <p class = 'bullet-title'>Common issues and solutions for animation playback errors in OWNverse:</p> <ol class='list-decimal paragraphs'> <li> <p><strong>Bone Animation Issues (T-Pose or A-Pose)</strong></p>  <p  class = 'paragraphs'>Problem: Some bones remain in T-pose.</p><p class = 'paragraphs'>Solution: Ensure the pose is added to the NLA Strip and follow Mixamo naming.</p> </li> <li>  <p  class = 'paragraphs'><strong>Multiple Animation Strips Not Recognized</strong></p>  <p  class = 'paragraphs'>Problem: OWNverse doesn’t detect multiple strips.</p><p class = 'paragraphs'>Solution: Export separate FBX files for each animation.</p> </li> <li>  <p  class = 'paragraphs'><strong>Model Moving Out of Center</strong></p>  <p  class = 'paragraphs'>Problem: The avatar drifts during animation.</p><p  class = 'paragraphs'>Solution: Keep the center bone fixed and verify scale.</p> </li> <li> <p class = 'paragraphs'><strong>Compatibility with Custom Rigs</strong></p> <p class = 'paragraphs'>Solution: Remove IK and Pole bones before export.</p> </li> </ol>",
      "Conclusion": "<p class='bullet-title'>Conclusion</p> <p class = 'paragraphs'>Exporting custom animations for the OWNverse VRM Viewer requires meticulous attention to detail, as its workflow differs from Unity-based VRM viewers. While the Blender export process involves standard practices such as baking animations, renaming bones, and properly using NLA, OWNverse introduces unique constraints that must be addressed. By following best practices—ensuring correct bone naming, separating animations into individual files, and maintaining center bone stability—users can prevent common issues and achieve smooth animation playback in OWNverse. This optimized workflow was applied during my contract with Narrasoft, significantly accelerating project completion. By streamlining the export process, animation integration became seamless, reducing troubleshooting time and improving overall efficiency. Although OWNverse currently lacks support for multiple animation strips, future updates may introduce better animation handling. Until then, adhering to these best practices ensures a reliable and efficient workflow for exporting custom animations.</p>"
    }
  ],
  "portfolio": [
    {
      "Title": "<p class='bullet-title'>Making of my Portfolio Website</p>",
      "Introduction": "<h2 class='bullet-title'>Introduction</h2> <p class='paragraphs'> The objective of this website is to showcase my skills in both creative and technical fields. With the rapid evolution of technology, especially AI, I decided to expand my skill set beyond its original scope. Web development serves as the perfect medium to integrate both creativity and technology, allowing me to express my design skills while also demonstrating my technical capabilities. This portfolio is a continuous work in progress, with ongoing improvements in automation and functionality. While the current focus is a balanced approach between creativity and technology, my future iterations will lean more toward the technical side, incorporating advanced features and optimizations. </p>",
      "Methodology": "<h2 class='bullet-title'>Methodology & Design Evolution</h2> <p class='paragraphs'> When I first started building this portfolio, I had a basic concept in mind, focusing mainly on structure rather than aesthetics. My initial design was simple, with minimal interactivity. However, as I progressed, I realized the need for a more engaging and user-friendly interface. To achieve this, I continuously iterated on the design—experimenting with layouts, typography, and responsiveness. One of the major shifts was transitioning from a static structure to a more dynamic layout using CSS Grid and Flexbox for better content organization. Additionally, animations were initially more prominent, but after testing, I opted for subtle transitions to maintain a clean and professional look. </p> <ol> <li> <h3 class='bullet-title'>Visual Progression</h3> <div class='flex flex-row items-center paragraphs space-y-10 md:grow md:w-4xl ' > <figure class='text-center cursor-pointer items-center space-x-10 space-y-10 '> <img src='./asset/case_studies/myweb/Start.png' /> <img src='./asset/case_studies/myweb/Start-logo animation.png' /> <img src='./asset/case_studies/myweb/afterStart-animation.png' /> <figcaption> This is the preloader and home page </figcaption> </figure> <figure class='text-center cursor-pointer'> <img src='./asset/case_studies/myweb/About Me.png' /> <img src='./asset/case_studies/myweb/Portfolio.png' /> <img src='./asset/case_studies/myweb/Case Studies.png' /> <img src='./asset/case_studies/myweb/Testing Projects.png' /> <img src='./asset/case_studies/myweb/AI Projects.png' /> <figcaption>Initial design of pages</figcaption> </figure> <figure class='text-center cursor-pointer space-y-10'> <img src='./asset/case_studies/myweb/BG.png' /> <figcaption> Background image however I decided to use css </figcaption> </figure> </div> </li> <li> <h3 class='bullet-title'>Future Enhancements</h3> <p class='paragraphs'> I plan to refine the UI further by improving color contrasts, optimizing spacing, and integrating interactive elements like an AI-powered assistant. Additionally, I am working on refining the theme toggle system for a smoother user experience. </p> </li> </ol>",
      "Structure": "<h2 class='bullet-title'>Website Structure</h2> <h3 class='bullet-title'>Home Page</h3> <p class='paragraphs'> The home page serves as the first impression of my portfolio. Instead of separating the introduction and the 'About Me' section, I decided to merge them into a single space to create a more personalized and cohesive experience. This layout aligns with the overall theme of the website, making it more engaging while maintaining clarity. </p> <h3 class='bullet-title'>Portfolio Page</h3> <p class='paragraphs'> For the portfolio page, I implemented a combination of Flexbox and CSS Grid to achieve a structured yet visually dynamic layout. The goal was to present the content in a way that resembles reading a well-designed magazine—organized yet fluid. While some projects are already displayed, additional projects will be uploaded once I finalize their layout and presentation strategy. </p>",
      "Design": "<h2 class='bullet-title'>Design & Styling</h2> <p class='paragraphs'> At this stage, the design is still being refined. The primary goal is to ensure full responsiveness on both desktop and mobile screens, allowing for a seamless browsing experience. Tailwind CSS was chosen for its efficiency in styling and ease of maintenance. Regarding animations, I opted for a minimalistic approach—subtle and purposeful. Overuse of animations can be distracting, so I carefully balanced them to enhance the user experience without overwhelming the interface. </p>",
      "Additional": "<h2 class='bullet-title'> Additional Features (Planned Enhancements) </h2> <h3 class='bullet-title'>AI Feature</h3> <p class='paragraphs'> One of the planned additions is an AI-powered interactive avatar. This feature will allow visitors to ask personalized questions beyond what is explicitly mentioned on the website, such as inquiries about my work experience, education, or skills. This will add an interactive and innovative element to the portfolio. </p> <h3 class='bullet-title'>Theme Toggle Mode</h3> <p class='paragraphs'> Dark mode and light mode options are currently in development. I am refining the CSS variables to ensure a smooth transition between themes, allowing users to customize their viewing experience. </p>",
      "Deployment": "<h2 class='bullet-title'>Deployment & Optimization</h2> <p class='paragraphs'> For deployment, I use Firebase instead of GitHub Pages due to the dynamic features I intend to implement in future updates. Firebase provides more flexibility for real-time interactions and potential backend functionalities. Although the website does not have a heavy backend load, I am still optimizing it for performance. Given its lightweight nature, extensive optimization is not a priority at the moment, but minor improvements are continuously being made to enhance speed and efficiency. </p>"
    }
  ]
}
